USE test;

DROP TABLE IF EXISTS books;
CREATE TABLE books (
 id INT(4) NOT NULL AUTO_INCREMENT,
 title VARCHAR(100) NOT NULL,
 description VARCHAR(255) NOT NULL,
 author VARCHAR(100) NOT NULL,
 isbn VARCHAR(20) NOT NULL,
 print_year INT(4) NOT NULL,
 read_already BIT(1) NOT NULL DEFAULT b'0',
 PRIMARY KEY(id))
ENGINE = InnoDB 
DEFAULT CHARACTER SET = utf8;
INSERT INTO  books (title, description, author, isbn, print_year, read_already) VALUES 
('Spring in action', 'NULL', 'Крейг Уоллс', '978-5-94074-568-6', 2015, false),
('Java. Библиотека профессионала. Том 1. Основы', 'NULL', 'Кей Хорстманн', '978-5-8459-2084-3', 2016, false),
('Архитектура компьютера', 'NULL', 'Таненбаум Эндрю, Остин Т.', '978-5-496-00337-7', 2013, false),
('Философия Java', 'NULL', 'Брюс Эккель', '978-5-496-01127-3', 2015, false),
('Война и мир. Том 1', 'NULL', 'Лев Толстой', '978-5-00112-098-8', 2018, false),
('Война и мир. Том 2', 'NULL', 'Лев Толстой', '978-5-00112-098-8', 2018, false),
('Мастер и Маргарита', 'NULL', 'Михаил Булгаков', '978-5-04-090728-1', 2018, false),
('Преступление и наказание', 'NULL', 'Федор Достоевский', '978-5-9268-2545-6', 2017, false),
('Анна Каренина', 'NULL', 'Лев Толстой', '978-5-9268-2544-9', 2017, false),
('Мёртвые души', 'NULL', 'Николай Гоголь', '978-5-9268-2775-7', 2018, false),
('Собачье сердце', 'NULL', 'Михаил Булгаков', '978-5-17-091876-8', 2015, false),
('Евгений Онегин', 'NULL', 'Александр Пушкин', '978-5-91045-570-6', 2014, false),
('Отцы и дети', 'NULL', 'Иван Тургенев', '978-5-9268-2711-5', 2018, false),
('Герой нашего времени', 'NULL', 'Михаил Лермонтов', '978-5-9268-2710-8', 2018, false),
('Капитанская дочка', 'NULL', 'Александр Пушкин', '978-5-9268-2707-8', 2012, false),
('1984', 'NULL', 'Джордж Оруэлл', '978-5-17-080115-2', 2016, false),
('451 градус по Фаренгейту', 'NULL', 'Рэй Брэдбери', '978-5-9925-0475-0', 2013, false),
('Пикник на обочине', 'NULL', 'Стругацкий, Стругацкий', '978-5-17-088647-0', 2015, false),
('Старик и море', 'NULL', 'Эрнест Хемингуэй', '978-5-17-097653-9', 2016, false),
('Гамлет, принц датский', 'NULL', 'Уильям Шекспир', '978-5-00108-050-3', 2017, false),
('Портрет Дориана Грея', 'NULL', 'Оскар Уайльд', '978-5-9268-2790-0', 2018, false),
('Муму', 'NULL', 'Иван Тургенев', '978-5-00108-149-4', 2016, false)
;
 